# Dependency Check

In [1]:
import pandas

In [2]:
import sklearn

In [3]:
import matplotlib

# Erzeuge Beispieldaten

In [4]:
import random
random.randint(0,1)

0

In [5]:
anz_kunden = 100

d = {"alter":[],
     "einkommen":[],
     "km_stand":[],
     "kauf":[]
    }

for kunde_id in range(anz_kunden):    
    d["alter"].append( random.randint(18,99) )
    d["einkommen"].append( random.randint(5000, 100000) )
    d["km_stand"].append( random.randint(0, 200000) )
    if d["einkommen"][-1] > 50000:
        if d["km_stand"][-1] < 30000:
            d["kauf"].append( 1 )
        else:
            d["kauf"].append( 0 )
    else:
        d["kauf"].append( 0 )

In [6]:
for key in d:
    print(d[key][:5])

[37, 26, 98, 96, 95]
[66722, 17898, 68985, 62498, 88536]
[198649, 41259, 153409, 48413, 134371]
[0, 0, 0, 0, 0]

In [7]:
t = pandas.DataFrame(d)
t

    alter  einkommen  km_stand  kauf
0      37      66722    198649     0
1      26      17898     41259     0
2      98      68985    153409     0
3      96      62498     48413     0
4      95      88536    134371     0
..    ...        ...       ...   ...
95     56      98908    129032     0
96     18       9685    135532     0
97     90      22513     79479     0
98     37      90741      2088     1
99     19       7659     20363     0

[100 rows x 4 columns]

# Input-Output-Split (x|y)

In [8]:
x = t[ ["alter", "einkommen", "km_stand"] ]
x

    alter  einkommen  km_stand
0      37      66722    198649
1      26      17898     41259
2      98      68985    153409
3      96      62498     48413
4      95      88536    134371
..    ...        ...       ...
95     56      98908    129032
96     18       9685    135532
97     90      22513     79479
98     37      90741      2088
99     19       7659     20363

[100 rows x 3 columns]

In [9]:
y = t[ ["kauf"] ]
y

    kauf
0      0
1      0
2      0
3      0
4      0
..   ...
95     0
96     0
97     0
98     1
99     0

[100 rows x 1 columns]

# Train-Test-Split

In [10]:
from sklearn.model_selection import train_test_split

In [11]:
x_train, x_test, y_train, y_test = train_test_split(x, y, test_size=0.2)

In [12]:
x_train

    alter  einkommen  km_stand
2      98      68985    153409
38     34      86573    144182
31     87      52490    194355
72     50      53756     94113
34     83      20252     29804
..    ...        ...       ...
32     82      21628    194493
62     18      86679     22876
91     85      36418    155128
9      37      28829    115117
83     97      43791     57680

[80 rows x 3 columns]

In [13]:
x_train.shape

(80, 3)

In [14]:
y_train.shape

(80, 1)

In [15]:
x_test.shape

(20, 3)

In [16]:
y_test.shape

(20, 1)

# Machine Learning mit scikit-learn

In [17]:
from sklearn import tree
model = tree.DecisionTreeClassifier()
model = model.fit(x_train, y_train)

# Decision Tree visualisieren

In [18]:
txt = tree.export_text(model)
print(txt)

|--- feature_2 <= 29778.00
|   |--- feature_1 <= 54236.00
|   |   |--- class: 0
|   |--- feature_1 >  54236.00
|   |   |--- class: 1
|--- feature_2 >  29778.00
|   |--- class: 0

In [19]:
import graphviz 
dot_data = tree.export_graphviz(model,
                                out_file=None, 
                                feature_names=x_train.columns,
                                class_names=["Kein Kauf", "Kauf"],                                
                                filled=True,
                                rounded=True,  
                                special_characters=True) 
graph = graphviz.Source(dot_data) 
graph.render("Entscheidungsbaum")

'Entscheidungsbaum.pdf'

# Modell anwenden

In [20]:
x_test[:5]

    alter  einkommen  km_stand
64     75      74240     81129
29     48      58412    177096
10     78      67645    115540
82     89      67538      9638
53     94      21690    166681

In [21]:
x_test.shape

(20, 3)

In [22]:
preds = model.predict(x_test)
preds

array([0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0])

In [23]:
y_test["kauf"].values

array([0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0])

In [32]:
model.predict( [[46, 100000, 25000]] )

/home/juebrauer/prg/miniconda3/envs/e1/lib/python3.9/site-packages/sklearn/base.py:420: UserWarning: X does not have valid feature names, but DecisionTreeClassifier was fitted with feature names
  warnings.warn(

array([1])